In [ ]:
Table: Employee

+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |
+--------------+---------+
id is the primary key (column with unique values) for this table.
departmentId is a foreign key (reference column) of the ID from the Department table.
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.


Table: Department

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID of a department and its name.


A company's executives are interested in seeing who earns the most money in each of the company's departments. A high earner in a department is an employee who has a salary in the top three unique salaries for that department.

Write a solution to find the employees who are high earners in each of the departments.

Return the result table in any order.

The result format is in the following example.



Example 1:

Input:
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 85000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |
| 7  | Will  | 70000  | 1            |
+----+-------+--------+--------------+
Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+
Output:
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| IT         | Joe      | 85000  |
| IT         | Randy    | 85000  |
| IT         | Will     | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |
+------------+----------+--------+
Explanation:
In the IT department:
- Max earns the highest unique salary
- Both Randy and Joe earn the second-highest unique salary
- Will earns the third-highest unique salary

In the Sales department:
- Henry earns the highest salary
- Sam earns the second-highest salary
- There is no third-highest salary as there are only two employees

# **Resposta Correta:**

In [ ]:
WITH CTE AS (
    SELECT DENSE_RANK() OVER(PARTITION BY d.name ORDER BY e.salary DESC) AS ranking
    , e.name as Employee
    , e.salary as Salary
    , d.name as Department
FROM employee e
JOIN department d
    ON d.id = e.departmentId
)SELECT CTE.Department
    , CTE.Employee
    , CTE.Salary
FROM CTE
WHERE CTE.ranking <= 3

# **Explicação:**

**1. CTE (Common Table Expression)**


    WITH CTE AS (
        SELECT DENSE_RANK() OVER(PARTITION BY d.name ORDER BY e.salary DESC) AS ranking,
              e.name AS Employee,
              e.salary AS Salary,
              d.name AS Department
        FROM employee e
        JOIN department d ON d.id = e.departmentId
    )
**JOIN:**
Junta a tabela Employee com Department para obter o nome do departamento de cada funcionário.

    DENSE_RANK() OVER(PARTITION BY d.name ORDER BY e.salary DESC):

Agrupa os funcionários por departamento
  
    (PARTITION BY d.name).

Ordena os salários em ordem decrescente
   
    (ORDER BY e.salary DESC).

Atribui um ranking denso para os salários:

Salários iguais recebem o mesmo ranking.

Rankings não pulam números

    (diferente de RANK()).

Exemplo: salários 90000, 85000, 85000, 70000 → rankings 1, 2, 2, 3.

**2. Filtragem dos Top 3**

    SELECT CTE.Department,
          CTE.Employee,
          CTE.Salary
    FROM CTE
    WHERE CTE.ranking <= 3
Seleciona apenas os funcionários que têm ranking 1, 2 ou 3 — ou seja, estão entre os três maiores salários únicos do seu departamento.

# Fontes:

**Link do Site da Atividade:** https://leetcode.com/

**Link da Atividade:** https://leetcode.com/problems/department-top-three-salaries/submissions/1766591906/